{
  "title": "Smart Environmental Monitoring & Decision System",
  "shortDescription": "تصميم نظام ذكي يراقب المتغيرات البيئية ويحللها ويصدر تنبيهًا عند خروجها عن الحدود الآمنة.",
  "description": "يمثل هذا المشروع تتويجًا لمهارات برمجة الأنظمة الذكية المكتسبة خلال المقرر، حيث يطور الطلاب نظامًا ذكيًا متكاملًا داخل بيئة المحاكاة الرقمية باستخدام لوحة Arduino Uno.\nيعتمد النظام على قراءة أكثر من متغير بيئي (درجة الحرارة – شدة الإضاءة)، وعرض القيم المقروءة على وسيلة عرض مناسبة، ثم مقارنة القيم بحدود آمنة محددة مسبقًا، واتخاذ قرار تنبيهي عند خروج أي متغير عن النطاق الآمن.\nيركز المشروع على دمج مفاهيم الاستشعار، المراقبة المستمرة، تحليل البيانات، اتخاذ القرار البرمجي، وتفسير سلوك النظام في حالات متعددة.\nكما يسهم في تنمية مهارات التفكير المنظومي، حل المشكلات، والعمل التعاوني المتقدم.",
  "difficulty": "advanced",
  "category": "other",
  "estimatedDuration": 20,
  "deadline": "2026-05-30T23:59:00",
  "points": 200,
  "isPublished": true,
  "objectives": [
    "أن يتمكن الطلاب من تحليل مشكلة بيئية تعليمية وتحديد المتغيرات المؤثرة فيها بدقة لا تقل عن 85%.",
    "أن يتمكن الطلاب من تصميم وتنفيذ نظام ذكي يستخدم حساسين مختلفين داخل بيئة المحاكاة دون أخطاء.",
    "أن يتمكن الطلاب من تطوير برنامج يقرأ القيم البيئية ويقارنها بالحدود الآمنة ويصدر تنبيهًا مناسبًا بنسبة صحة لا تقل عن 85%."
  ],
  "showObjectives": true,
  "learningScenario": "1. يبدأ الطلاب بقراءة وصف المشكلة البيئية التعليمية.\n2. يناقش الفريق المتغيرات البيئية المؤثرة (حرارة – إضاءة).\n3. يحدد الفريق الحدود الآمنة لكل متغير.\n4. ينفذ الطلاب التوصيلات داخل بيئة المحاكاة.\n5. يطور الطالب المسؤول الكود البرمجي.\n6. يختبر الفريق النظام في سيناريوهات مختلفة.\n7. يعدّ الفريق التقرير النهائي.\n8. يقدم الطلاب عرضًا شفهيًا للمشروع.",
  "teachingStrategy": "1. التعلم القائم على المشروعات\n2. التعلم التعاوني القائم على الأدوار\n3. التقويم القائم على الأداء",
  "finalReportNote": "يقوم الفريق بإعداد تقرير شامل يوضح المشكلة، فكرة النظام، الحساسات المستخدمة، الحدود الآمنة، منطق اتخاذ القرار، نتائج الاختبار، ودور كل طالب، ويُعد التقرير المنتج النهائي للمشروع.",
  "isTeamProject": true,
  "hasObservationCard": true,
  "projectOrder": 6,
  "projectLevel": "expert"
}
