{
  "title": "Smart LED Controller (Button → LED)",
  "shortDescription": "تصميم نظام تحكم بسيط يستخدم زر Button للتحكم في تشغيل وإيقاف LED خارجي داخل بيئة المحاكاة.",
  "description": "يهدف هذا المشروع إلى نقل الطلاب من مرحلة التحكم في المخرجات الداخلية إلى التعامل مع المدخلات والمخرجات الخارجية داخل بيئة المحاكاة الرقمية.\nيقوم الطلاب بتصميم وتنفيذ نظام تحكم بسيط يعتمد على زر Button كمدخل، وLED كمخرج، باستخدام لوحة Arduino Uno.\nيركز المشروع على تنمية الفهم العملي لمفاهيم Input / Output، وبناء أول منطق تحكم شرطي، وتنمية مهارات العمل التعاوني القائم على الأدوار.\nكما يسهم المشروع في تطوير قدرة الطلاب على الربط بين التوصيلات داخل بيئة المحاكاة والمنطق البرمجي المستخدم للتحكم في المخرجات.",
  "difficulty": "beginner",
  "category": "other",
  "estimatedDuration": 8,
  "deadline": "2026-03-05T23:59:00",
  "points": 100,
  "isPublished": true,
  "objectives": [
    "أن يتمكن الطلاب من شرح مفهوم المدخل والمخرج في الأنظمة الذكية في ظل نظام Button → LED بدقة لا تقل عن 85%.",
    "أن يتمكن الطلاب من تنفيذ توصيل صحيح لزر Button وLED باستخدام لوحة Arduino Uno داخل بيئة المحاكاة دون أخطاء.",
    "أن يتمكن الطلاب من كتابة برنامج بسيط يستخدم digitalRead و digitalWrite للتحكم في تشغيل وإيقاف LED وفق حالة الزر بنسبة صحة لا تقل عن 85%."
  ],
  "showObjectives": true,
  "learningScenario": "1. يبدأ الطلاب بقراءة وصف المشكلة التعليمية وفهم فكرة التحكم اليدوي.\n2. يناقش الفريق دور Button كمدخل وLED كمخرج.\n3. يخطط الفريق لتصميم النظام داخل بيئة المحاكاة.\n4. ينفذ الطلاب التوصيلات الافتراضية للمكونات.\n5. يكتب الطالب المسؤول عن البرمجة الكود المطلوب.\n6. يختبر الفريق النظام ويتحقق من صحة التشغيل.\n7. يعدّ الفريق تقرير المشروع النهائي.",
  "teachingStrategy": "1. التعلم القائم على المشروعات\n2. التعلم التعاوني القائم على الأدوار",
  "finalReportNote": "يقوم الفريق بإعداد تقرير جماعي يوضح وصف المشكلة، فكرة الحل، التوصيلات المستخدمة، منطق البرنامج، ودور كل طالب، ويُعد التقرير المنتج النهائي للمشروع.",
  "isTeamProject": true,
  "hasObservationCard": true,
  "projectOrder": 1,
  "projectLevel": "beginner"
}
