{
  "title": "Smart Temperature Monitoring & Alert System",
  "shortDescription": "تصميم نظام ذكي يراقب درجة الحرارة ويعرضها ويصدر تنبيهًا عند تجاوز الحد المحدد.",
  "description": "يهدف هذا المشروع إلى تنمية قدرة الطلاب على تصميم نظام ذكي يعتمد على قراءة بيانات فيزيائية مستمرة (درجة الحرارة) وتحليلها واتخاذ قرار مناسب بناءً عليها.\nيقوم الطلاب بتطوير نظام داخل بيئة المحاكاة الرقمية باستخدام لوحة Arduino Uno وحساس حرارة (مثل LM35 – محاكاة)، بحيث يقوم النظام بقراءة درجة الحرارة، وعرضها على وسيلة عرض مناسبة، ثم مقارنة القيمة المقروءة بحد محدد مسبقًا (Threshold)، وتفعيل مخرج تنبيهي (LED أو Buzzer) عند تجاوز هذا الحد.\nيركز المشروع على مفاهيم المراقبة المستمرة، قراءة الإشارات التناظرية، تحويل القيم، اتخاذ القرار البرمجي، وربط البيانات بسلوك النظام.",
  "difficulty": "advanced",
  "category": "other",
  "estimatedDuration": 16,
  "deadline": "2026-05-10T23:59:00",
  "points": 100,
  "isPublished": true,
  "objectives": [
    "أن يتمكن الطلاب من شرح مبدأ عمل حساس الحرارة ومفهوم المراقبة المستمرة في الأنظمة الذكية بدقة لا تقل عن 85%.",
    "أن يتمكن الطلاب من تنفيذ توصيل صحيح لحساس الحرارة ووسيلة العرض ومخرج التنبيه داخل بيئة المحاكاة دون أخطاء.",
    "أن يتمكن الطلاب من كتابة برنامج يستخدم analogRead لقراءة درجة الحرارة، وتحويلها إلى قيمة مفهومة، وتنفيذ شرط برمجي للتنبيه بنسبة صحة لا تقل عن 85%."
  ],
  "showObjectives": true,
  "learningScenario": "1. يبدأ الطلاب بقراءة وصف مشكلة مراقبة درجة الحرارة.\n2. يناقش الفريق أهمية المراقبة الحرارية في الأنظمة الذكية.\n3. يحدد الفريق قيمة الحد (Threshold).\n4. ينفذ الطلاب التوصيلات داخل المحاكاة.\n5. يكتب الطالب المسؤول الكود البرمجي.\n6. يختبر الفريق النظام عند درجات حرارة مختلفة.\n7. يعدّ الفريق تقرير المشروع النهائي.",
  "teachingStrategy": "1. التعلم القائم على المشروعات\n2. التعلم التعاوني القائم على الأدوار",
  "finalReportNote": "يقوم الفريق بإعداد تقرير جماعي يوضح فكرة النظام، مبدأ عمل الحساس، قيمة الحد المحدد، منطق القرار، صور من المحاكاة، ونتائج الاختبار.",
  "isTeamProject": true,
  "hasObservationCard": true,
  "projectOrder": 5,
  "projectLevel": "advanced"
}
